ExperimentResults/multiple-producer-2-to-single-consumer.txt
39385 records sent, 7877.0 records/sec (7.51 MB/sec), 686.8 ms avg latency, 1902.0 ms max latency.
59975 records sent, 11985.4 records/sec (11.43 MB/sec), 321.2 ms avg latency, 1816.0 ms max latency.
44656 records sent, 8929.4 records/sec (8.52 MB/sec), 197.9 ms avg latency, 887.0 ms max latency.
28019 records sent, 5596.0 records/sec (5.34 MB/sec), 1249.8 ms avg latency, 3229.0 ms max latency.
17766 records sent, 3548.9 records/sec (3.38 MB/sec), 3940.0 ms avg latency, 6430.0 ms max latency.
21042 records sent, 4187.5 records/sec (3.99 MB/sec), 7704.1 ms avg latency, 9411.0 ms max latency.
28980 records sent, 5774.1 records/sec (5.51 MB/sec), 10311.6 ms avg latency, 11634.0 ms max latency.
32004 records sent, 6386.7 records/sec (6.09 MB/sec), 11190.4 ms avg latency, 12922.0 ms max latency.
11214 records sent, 2242.4 records/sec (2.14 MB/sec), 12176.9 ms avg latency, 15635.0 ms max latency.
26082 records sent, 5199.8 records/sec (4.96 MB/sec), 13902.3 ms avg latency, 16270.0 ms max latency.
12222 records sent, 2410.7 records/sec (2.30 MB/sec), 15705.2 ms avg latency, 19663.0 ms max latency.
7434 records sent, 1420.3 records/sec (1.35 MB/sec), 19152.5 ms avg latency, 23191.0 ms max latency.
32256 records sent, 6451.2 records/sec (6.15 MB/sec), 20339.7 ms avg latency, 25062.0 ms max latency.
23184 records sent, 4467.1 records/sec (4.26 MB/sec), 17564.5 ms avg latency, 20952.0 ms max latency.
24318 records sent, 4845.2 records/sec (4.62 MB/sec), 14177.4 ms avg latency, 20822.0 ms max latency.
22050 records sent, 4403.0 records/sec (4.20 MB/sec), 13696.1 ms avg latency, 15998.0 ms max latency.
34398 records sent, 6849.5 records/sec (6.53 MB/sec), 13348.3 ms avg latency, 16617.0 ms max latency.
17262 records sent, 3394.0 records/sec (3.24 MB/sec), 12063.5 ms avg latency, 15394.0 ms max latency.
19656 records sent, 3921.0 records/sec (3.74 MB/sec), 14092.2 ms avg latency, 16722.0 ms max latency.
16002 records sent, 3197.8 records/sec (3.05 MB/sec), 15400.0 ms avg latency, 18196.0 ms max latency.
24318 records sent, 4856.8 records/sec (4.63 MB/sec), 17184.5 ms avg latency, 20237.0 ms max latency.
16380 records sent, 3266.2 records/sec (3.11 MB/sec), 17116.4 ms avg latency, 21537.0 ms max latency.
24822 records sent, 4937.7 records/sec (4.71 MB/sec), 16438.3 ms avg latency, 21311.0 ms max latency.
12222 records sent, 2339.6 records/sec (2.23 MB/sec), 15904.8 ms avg latency, 20541.0 ms max latency.
18018 records sent, 3585.0 records/sec (3.42 MB/sec), 17904.1 ms avg latency, 22431.0 ms max latency.
23562 records sent, 4710.5 records/sec (4.49 MB/sec), 18474.6 ms avg latency, 23201.0 ms max latency.
20790 records sent, 4148.0 records/sec (3.96 MB/sec), 16888.9 ms avg latency, 22153.0 ms max latency.
20664 records sent, 4132.8 records/sec (3.94 MB/sec), 16592.8 ms avg latency, 24556.0 ms max latency.
21798 records sent, 4353.5 records/sec (4.15 MB/sec), 15065.5 ms avg latency, 22395.0 ms max latency.
23436 records sent, 4686.3 records/sec (4.47 MB/sec), 15613.8 ms avg latency, 21163.0 ms max latency.
19404 records sent, 3867.6 records/sec (3.69 MB/sec), 14872.8 ms avg latency, 21721.0 ms max latency.
25830 records sent, 5153.6 records/sec (4.91 MB/sec), 14803.0 ms avg latency, 21676.0 ms max latency.
15876 records sent, 3127.7 records/sec (2.98 MB/sec), 14519.8 ms avg latency, 21175.0 ms max latency.
15498 records sent, 3085.4 records/sec (2.94 MB/sec), 17241.6 ms avg latency, 22374.0 ms max latency.
13230 records sent, 2639.7 records/sec (2.52 MB/sec), 17891.0 ms avg latency, 24661.0 ms max latency.
18396 records sent, 3662.4 records/sec (3.49 MB/sec), 19143.2 ms avg latency, 25544.0 ms max latency.
9702 records sent, 1931.9 records/sec (1.84 MB/sec), 20522.1 ms avg latency, 28108.0 ms max latency.
18270 records sent, 3646.7 records/sec (3.48 MB/sec), 22498.2 ms avg latency, 29480.0 ms max latency.
20286 records sent, 4042.6 records/sec (3.86 MB/sec), 21539.1 ms avg latency, 30484.0 ms max latency.
19656 records sent, 3916.3 records/sec (3.73 MB/sec), 19576.7 ms avg latency, 27550.0 ms max latency.
11088 records sent, 2210.5 records/sec (2.11 MB/sec), 20909.5 ms avg latency, 28883.0 ms max latency.
18018 records sent, 3537.8 records/sec (3.37 MB/sec), 19542.7 ms avg latency, 27923.0 ms max latency.
20286 records sent, 4038.6 records/sec (3.85 MB/sec), 19071.1 ms avg latency, 26042.0 ms max latency.
19026 records sent, 3805.2 records/sec (3.63 MB/sec), 19256.5 ms avg latency, 25166.0 ms max latency.
21294 records sent, 4252.8 records/sec (4.06 MB/sec), 17592.8 ms avg latency, 25098.0 ms max latency.
26712 records sent, 5280.1 records/sec (5.04 MB/sec), 16067.0 ms avg latency, 21650.0 ms max latency.
13356 records sent, 2649.5 records/sec (2.53 MB/sec), 14708.9 ms avg latency, 18655.0 ms max latency.
10080 records sent, 2007.2 records/sec (1.91 MB/sec), 17580.9 ms avg latency, 22243.0 ms max latency.
16128 records sent, 3123.8 records/sec (2.98 MB/sec), 19695.3 ms avg latency, 23549.0 ms max latency.
12348 records sent, 2463.2 records/sec (2.35 MB/sec), 20442.2 ms avg latency, 25659.0 ms max latency.
15372 records sent, 3059.7 records/sec (2.92 MB/sec), 22849.2 ms avg latency, 28125.0 ms max latency.
12726 records sent, 2499.2 records/sec (2.38 MB/sec), 23806.5 ms avg latency, 30829.0 ms max latency.
5040 records sent, 965.5 records/sec (0.92 MB/sec), 26103.7 ms avg latency, 34277.0 ms max latency.
9702 records sent, 1917.0 records/sec (1.83 MB/sec), 29028.4 ms avg latency, 37618.0 ms max latency.
14742 records sent, 2943.7 records/sec (2.81 MB/sec), 29309.5 ms avg latency, 38027.0 ms max latency.
13356 records sent, 2656.3 records/sec (2.53 MB/sec), 28641.0 ms avg latency, 34968.0 ms max latency.
28602 records sent, 5435.6 records/sec (5.18 MB/sec), 25755.0 ms avg latency, 35961.0 ms max latency.
55818 records sent, 11123.6 records/sec (10.61 MB/sec), 12866.6 ms avg latency, 29670.0 ms max latency.
54054 records sent, 10808.6 records/sec (10.31 MB/sec), 6083.6 ms avg latency, 11760.0 ms max latency.
40446 records sent, 8073.1 records/sec (7.70 MB/sec), 6674.6 ms avg latency, 9057.0 ms max latency.
16758 records sent, 3295.6 records/sec (3.14 MB/sec), 8102.8 ms avg latency, 12922.0 ms max latency.
15876 records sent, 3061.9 records/sec (2.92 MB/sec), 11688.2 ms avg latency, 16622.0 ms max latency.
4788 records sent, 673.4 records/sec (0.64 MB/sec), 15108.4 ms avg latency, 20346.0 ms max latency.
25326 records sent, 5048.0 records/sec (4.81 MB/sec), 22475.7 ms avg latency, 27427.0 ms max latency.
44226 records sent, 8802.9 records/sec (8.40 MB/sec), 16964.6 ms avg latency, 26801.0 ms max latency.
38052 records sent, 7568.0 records/sec (7.22 MB/sec), 10311.6 ms avg latency, 26467.0 ms max latency.
34776 records sent, 6955.2 records/sec (6.63 MB/sec), 8294.1 ms avg latency, 13113.0 ms max latency.
38934 records sent, 7774.4 records/sec (7.41 MB/sec), 9028.9 ms avg latency, 14125.0 ms max latency.
41580 records sent, 8304.4 records/sec (7.92 MB/sec), 8488.3 ms avg latency, 13904.0 ms max latency.
31626 records sent, 6323.9 records/sec (6.03 MB/sec), 8008.1 ms avg latency, 12950.0 ms max latency.
44745 records sent, 8900.9 records/sec (8.49 MB/sec), 8927.8 ms avg latency, 14292.0 ms max latency.
41439 records sent, 8256.4 records/sec (7.87 MB/sec), 8432.0 ms avg latency, 13651.0 ms max latency.
40887 records sent, 8074.1 records/sec (7.70 MB/sec), 7591.6 ms avg latency, 13664.0 ms max latency.
28350 records sent, 5665.5 records/sec (5.40 MB/sec), 8356.4 ms avg latency, 13380.0 ms max latency.
22806 records sent, 4551.2 records/sec (4.34 MB/sec), 10385.3 ms avg latency, 15465.0 ms max latency.
10458 records sent, 1441.3 records/sec (1.37 MB/sec), 11663.6 ms avg latency, 21322.0 ms max latency.
42462 records sent, 8485.6 records/sec (8.09 MB/sec), 17215.6 ms avg latency, 23259.0 ms max latency.
39690 records sent, 7901.7 records/sec (7.54 MB/sec), 12352.5 ms avg latency, 20883.0 ms max latency.
34524 records sent, 6892.4 records/sec (6.57 MB/sec), 8384.2 ms avg latency, 17217.0 ms max latency.
35280 records sent, 7049.0 records/sec (6.72 MB/sec), 9148.9 ms avg latency, 13705.0 ms max latency.
35406 records sent, 7081.2 records/sec (6.75 MB/sec), 9249.6 ms avg latency, 14724.0 ms max latency.
22806 records sent, 4521.4 records/sec (4.31 MB/sec), 9790.3 ms avg latency, 16754.0 ms max latency.
34524 records sent, 6877.3 records/sec (6.56 MB/sec), 11128.7 ms avg latency, 17488.0 ms max latency.
36540 records sent, 7294.9 records/sec (6.96 MB/sec), 10126.6 ms avg latency, 17421.0 ms max latency.
21924 records sent, 4355.2 records/sec (4.15 MB/sec), 10372.8 ms avg latency, 18521.0 ms max latency.
32760 records sent, 6525.9 records/sec (6.22 MB/sec), 11433.7 ms avg latency, 18538.0 ms max latency.
39816 records sent, 7947.3 records/sec (7.58 MB/sec), 10609.6 ms avg latency, 18093.0 ms max latency.
47628 records sent, 9512.3 records/sec (9.07 MB/sec), 8294.6 ms avg latency, 17503.0 ms max latency.
40446 records sent, 8074.7 records/sec (7.70 MB/sec), 7517.0 ms avg latency, 13582.0 ms max latency.
28854 records sent, 5754.7 records/sec (5.49 MB/sec), 8344.2 ms avg latency, 14555.0 ms max latency.
38682 records sent, 7685.7 records/sec (7.33 MB/sec), 9410.5 ms avg latency, 16398.0 ms max latency.
40068 records sent, 8008.8 records/sec (7.64 MB/sec), 8985.8 ms avg latency, 17157.0 ms max latency.
42084 records sent, 8384.9 records/sec (8.00 MB/sec), 8247.4 ms avg latency, 17435.0 ms max latency.
56448 records sent, 11244.6 records/sec (10.72 MB/sec), 6571.6 ms avg latency, 18022.0 ms max latency.
39123 records sent, 4905.1 records/sec (4.68 MB/sec), 6313.3 ms avg latency, 15163.0 ms max latency.
57161 records sent, 11398.0 records/sec (10.87 MB/sec), 9011.0 ms avg latency, 20326.0 ms max latency.
27911 records sent, 5578.9 records/sec (5.32 MB/sec), 8279.9 ms avg latency, 20810.0 ms max latency.
25830 records sent, 5113.8 records/sec (4.88 MB/sec), 9807.5 ms avg latency, 23241.0 ms max latency.
18774 records sent, 3523.6 records/sec (3.36 MB/sec), 12013.6 ms avg latency, 26493.0 ms max latency.
35154 records sent, 7021.0 records/sec (6.70 MB/sec), 12135.1 ms avg latency, 28142.0 ms max latency.
46620 records sent, 9013.9 records/sec (8.60 MB/sec), 10506.6 ms avg latency, 24762.0 ms max latency.
41013 records sent, 8178.1 records/sec (7.80 MB/sec), 8901.6 ms avg latency, 24417.0 ms max latency.
48952 records sent, 9772.8 records/sec (9.32 MB/sec), 7632.9 ms avg latency, 22231.0 ms max latency.
38698 records sent, 6560.1 records/sec (6.26 MB/sec), 7564.5 ms avg latency, 17275.0 ms max latency.
43092 records sent, 7860.6 records/sec (7.50 MB/sec), 8563.7 ms avg latency, 18795.0 ms max latency.
22932 records sent, 1060.6 records/sec (1.01 MB/sec), 8451.0 ms avg latency, 24997.0 ms max latency.
83601 records sent, 16706.8 records/sec (15.93 MB/sec), 18447.6 ms avg latency, 37922.0 ms max latency.
1512 records sent, 300.4 records/sec (0.29 MB/sec), 14373.8 ms avg latency, 37009.0 ms max latency.
38052 records sent, 7610.4 records/sec (7.26 MB/sec), 15451.2 ms avg latency, 39483.0 ms max latency.
50526 records sent, 10103.2 records/sec (9.64 MB/sec), 9871.8 ms avg latency, 36926.0 ms max latency.
34398 records sent, 6868.6 records/sec (6.55 MB/sec), 8039.6 ms avg latency, 21224.0 ms max latency.
31878 records sent, 6366.7 records/sec (6.07 MB/sec), 9888.7 ms avg latency, 23309.0 ms max latency.
37044 records sent, 7383.7 records/sec (7.04 MB/sec), 8605.9 ms avg latency, 19502.0 ms max latency.
45486 records sent, 9032.2 records/sec (8.61 MB/sec), 8491.3 ms avg latency, 20257.0 ms max latency.
12600 records sent, 2442.3 records/sec (2.33 MB/sec), 7945.0 ms avg latency, 21226.0 ms max latency.
630 records sent, 99.1 records/sec (0.09 MB/sec), 14186.6 ms avg latency, 28700.0 ms max latency.
59724 records sent, 11814.8 records/sec (11.27 MB/sec), 14484.9 ms avg latency, 30751.0 ms max latency.
5670 records sent, 964.4 records/sec (0.92 MB/sec), 12662.4 ms avg latency, 30550.0 ms max latency.
756 records sent, 146.7 records/sec (0.14 MB/sec), 16153.6 ms avg latency, 33631.0 ms max latency.
378 records sent, 62.2 records/sec (0.06 MB/sec), 20200.1 ms avg latency, 36690.0 ms max latency.
20664 records sent, 4129.5 records/sec (3.94 MB/sec), 33557.7 ms avg latency, 44756.0 ms max latency.
44100 records sent, 8793.6 records/sec (8.39 MB/sec), 24204.1 ms avg latency, 42304.0 ms max latency.
33768 records sent, 6710.7 records/sec (6.40 MB/sec), 11179.6 ms avg latency, 33795.0 ms max latency.
31248 records sent, 6219.7 records/sec (5.93 MB/sec), 11504.5 ms avg latency, 36410.0 ms max latency.
28854 records sent, 5726.1 records/sec (5.46 MB/sec), 10370.4 ms avg latency, 18915.0 ms max latency.
25074 records sent, 5013.8 records/sec (4.78 MB/sec), 11322.7 ms avg latency, 20328.0 ms max latency.
11970 records sent, 2145.5 records/sec (2.05 MB/sec), 11437.0 ms avg latency, 20240.0 ms max latency.
3150 records sent, 515.0 records/sec (0.49 MB/sec), 22194.8 ms avg latency, 27460.0 ms max latency.
15750 records sent, 2587.1 records/sec (2.47 MB/sec), 21495.1 ms avg latency, 31073.0 ms max latency.
2646 records sent, 522.9 records/sec (0.50 MB/sec), 24756.0 ms avg latency, 35382.0 ms max latency.
630 records sent, 123.3 records/sec (0.12 MB/sec), 31737.7 ms avg latency, 41894.0 ms max latency.
2268 records sent, 450.4 records/sec (0.43 MB/sec), 36344.3 ms avg latency, 46535.0 ms max latency.
27216 records sent, 5405.4 records/sec (5.15 MB/sec), 25417.4 ms avg latency, 51277.0 ms max latency.
22867 records sent, 4555.2 records/sec (4.34 MB/sec), 33336.2 ms avg latency, 52604.0 ms max latency.
30116 records sent, 6010.0 records/sec (5.73 MB/sec), 27919.4 ms avg latency, 51825.0 ms max latency.
30444 records sent, 6048.9 records/sec (5.77 MB/sec), 14416.6 ms avg latency, 49494.0 ms max latency.
27096 records sent, 5404.1 records/sec (5.15 MB/sec), 11454.8 ms avg latency, 39089.0 ms max latency.
28092 records sent, 5618.4 records/sec (5.36 MB/sec), 14198.3 ms avg latency, 21168.0 ms max latency.
31650 records sent, 6313.6 records/sec (6.02 MB/sec), 12359.3 ms avg latency, 19127.0 ms max latency.
15185 records sent, 3020.7 records/sec (2.88 MB/sec), 12449.5 ms avg latency, 19532.0 ms max latency.
6956 records sent, 1333.6 records/sec (1.27 MB/sec), 14373.6 ms avg latency, 22114.0 ms max latency.
4812 records sent, 961.2 records/sec (0.92 MB/sec), 18989.5 ms avg latency, 26225.0 ms max latency.
8997 records sent, 1798.0 records/sec (1.71 MB/sec), 20322.2 ms avg latency, 29443.0 ms max latency.
17160 records sent, 3212.3 records/sec (3.06 MB/sec), 25891.1 ms avg latency, 31754.0 ms max latency.
29311 records sent, 5659.6 records/sec (5.40 MB/sec), 24215.2 ms avg latency, 33167.0 ms max latency.
29483 records sent, 5893.1 records/sec (5.62 MB/sec), 18425.9 ms avg latency, 34520.0 ms max latency.
19985 records sent, 3993.8 records/sec (3.81 MB/sec), 15236.0 ms avg latency, 32397.0 ms max latency.
33498 records sent, 6696.9 records/sec (6.39 MB/sec), 13218.4 ms avg latency, 22567.0 ms max latency.
33689 records sent, 6733.8 records/sec (6.42 MB/sec), 11200.1 ms avg latency, 18120.0 ms max latency.
43300 records sent, 8635.8 records/sec (8.24 MB/sec), 7683.5 ms avg latency, 16442.0 ms max latency.
37368 records sent, 7473.6 records/sec (7.13 MB/sec), 7834.6 ms avg latency, 15834.0 ms max latency.
33642 records sent, 6642.1 records/sec (6.33 MB/sec), 8735.1 ms avg latency, 16649.0 ms max latency.
31248 records sent, 6184.0 records/sec (5.90 MB/sec), 9379.6 ms avg latency, 18639.0 ms max latency.
27672 records sent, 5465.5 records/sec (5.21 MB/sec), 10266.3 ms avg latency, 20260.0 ms max latency.
31312 records sent, 6033.1 records/sec (5.75 MB/sec), 10980.1 ms avg latency, 20664.0 ms max latency.
16254 records sent, 3151.2 records/sec (3.01 MB/sec), 11456.0 ms avg latency, 22922.0 ms max latency.
1260 records sent, 232.5 records/sec (0.22 MB/sec), 14311.9 ms avg latency, 26250.0 ms max latency.
378 records sent, 65.5 records/sec (0.06 MB/sec), 19766.0 ms avg latency, 29833.0 ms max latency.
4347 records sent, 807.1 records/sec (0.77 MB/sec), 25403.5 ms avg latency, 38775.0 ms max latency.
23562 records sent, 4688.0 records/sec (4.47 MB/sec), 24342.0 ms avg latency, 40635.0 ms max latency.
27216 records sent, 5162.4 records/sec (4.92 MB/sec), 24091.2 ms avg latency, 41501.0 ms max latency.
30870 records sent, 6156.8 records/sec (5.87 MB/sec), 23627.4 ms avg latency, 41643.0 ms max latency.
26334 records sent, 5262.6 records/sec (5.02 MB/sec), 16052.4 ms avg latency, 41988.0 ms max latency.
27342 records sent, 4801.9 records/sec (4.58 MB/sec), 14031.3 ms avg latency, 42419.0 ms max latency.
32508 records sent, 6482.2 records/sec (6.18 MB/sec), 11871.4 ms avg latency, 25266.0 ms max latency.
28791 records sent, 5754.7 records/sec (5.49 MB/sec), 12882.0 ms avg latency, 25754.0 ms max latency.
22050 records sent, 4395.9 records/sec (4.19 MB/sec), 11704.0 ms avg latency, 25583.0 ms max latency.
3906 records sent, 726.3 records/sec (0.69 MB/sec), 14184.8 ms avg latency, 29881.0 ms max latency.
2142 records sent, 421.6 records/sec (0.40 MB/sec), 19679.7 ms avg latency, 34579.0 ms max latency.
7434 records sent, 1470.6 records/sec (1.40 MB/sec), 23556.2 ms avg latency, 38691.0 ms max latency.
12348 records sent, 2461.2 records/sec (2.35 MB/sec), 22925.9 ms avg latency, 41178.0 ms max latency.
3402 records sent, 506.0 records/sec (0.48 MB/sec), 25345.3 ms avg latency, 45193.0 ms max latency.
37044 records sent, 7408.8 records/sec (7.07 MB/sec), 28920.2 ms avg latency, 48125.0 ms max latency.
29862 records sent, 5934.4 records/sec (5.66 MB/sec), 22445.8 ms avg latency, 43393.0 ms max latency.
39690 records sent, 7928.5 records/sec (7.56 MB/sec), 14529.3 ms avg latency, 42980.0 ms max latency.
27468 records sent, 5306.8 records/sec (5.06 MB/sec), 10592.7 ms avg latency, 29224.0 ms max latency.
30618 records sent, 6008.2 records/sec (5.73 MB/sec), 10863.1 ms avg latency, 20522.0 ms max latency.
25200 records sent, 4891.3 records/sec (4.66 MB/sec), 11074.5 ms avg latency, 21322.0 ms max latency.
20916 records sent, 4180.7 records/sec (3.99 MB/sec), 13191.9 ms avg latency, 23535.0 ms max latency.
22806 records sent, 4520.5 records/sec (4.31 MB/sec), 13508.1 ms avg latency, 25093.0 ms max latency.
8946 records sent, 1614.5 records/sec (1.54 MB/sec), 14293.5 ms avg latency, 26780.0 ms max latency.
24948 records sent, 4984.6 records/sec (4.75 MB/sec), 17080.0 ms avg latency, 29652.0 ms max latency.
35028 records sent, 7005.6 records/sec (6.68 MB/sec), 15702.0 ms avg latency, 28733.0 ms max latency.
37422 records sent, 7197.9 records/sec (6.86 MB/sec), 12216.3 ms avg latency, 27840.0 ms max latency.
34146 records sent, 6822.4 records/sec (6.51 MB/sec), 11697.3 ms avg latency, 24407.0 ms max latency.
37170 records sent, 7422.1 records/sec (7.08 MB/sec), 9354.3 ms avg latency, 16600.0 ms max latency.
28728 records sent, 5718.2 records/sec (5.45 MB/sec), 10010.1 ms avg latency, 17798.0 ms max latency.
27846 records sent, 5152.8 records/sec (4.91 MB/sec), 10290.5 ms avg latency, 18605.0 ms max latency.
23940 records sent, 4788.0 records/sec (4.57 MB/sec), 10010.9 ms avg latency, 21401.0 ms max latency.
35532 records sent, 7079.5 records/sec (6.75 MB/sec), 10385.8 ms avg latency, 23774.0 ms max latency.
13482 records sent, 2695.9 records/sec (2.57 MB/sec), 12012.5 ms avg latency, 24215.0 ms max latency.
36761 records sent, 7015.5 records/sec (6.69 MB/sec), 17210.8 ms avg latency, 29859.0 ms max latency.
5000000 records sent, 4942.777465 records/sec (4.71 MB/sec), 12966.58 ms avg latency, 52604.00 ms max latency, 11892 ms 50th, 32425 ms 95th, 42291 ms 99th, 51568 ms 99.9th.